In [1]:
import pandas as pd 
import numpy as np 
from scipy import stats

# Q1

In [2]:
q1 = pd.read_csv('Cutlets.csv')

In [3]:
q1.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [4]:
q1.shape

(35, 2)

In [5]:
X = q1['Unit A']

In [6]:
Y = q1['Unit B']

- H0 : MuA = MuB (There is no signifiacnt difference in the diameter)-
- Ha : MuA != MuB (There is difference in the cutlet)

Test : Two sample Two tail ttest

In [7]:
from scipy import stats
stats.ttest_ind(X,Y)

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

 p > 0.05
    hence ,we accept H0
    
### There is No significant difference in the diameter

# Q2

In [8]:
q2 = pd.read_csv('LabTAT.csv')

In [9]:
q2

     Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0          185.35        165.53        176.70        166.13
1          170.49        185.91        198.45        160.79
2          192.77        194.92        201.23        185.18
3          177.33        183.00        199.61        176.42
4          193.41        169.57        204.63        152.60
..            ...           ...           ...           ...
115        178.49        170.66        193.80        172.68
116        176.08        183.98        215.25        177.64
117        202.48        174.54        203.99        170.27
118        182.40        197.18        194.52        150.87
119        182.09        215.17        221.49        162.21

[120 rows x 4 columns]

- H0 : There is no Difference in TAT 
- Ha : There is a Difference in TAT

Test : Anova

In [10]:
stats.f_oneway(q2.iloc[:,0],q2.iloc[:,1],q2.iloc[:,2],q2.iloc[:,3])

F_onewayResult(statistic=118.70421654401437, pvalue=2.1156708949992414e-57)

p < 0.05 
### Hence ,We reject Null Hypothesis

# Q3

In [11]:
q3 = pd.read_csv('BuyerRatio.csv')

In [12]:
q3

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

- Null Hypothesis : There is no similarity between male and female acorss region 
- Alternative Hyp :  There is  similarity between male and female acorss region

In [13]:
# Contigency Table 
table =[[50,142,131,70],[435,1523,1356,750]]

In [14]:
stat,p,dof,expected = stats.chi2_contingency(table)
print('dof=%d' %dof)
print(p)

dof=3
0.6603094907091882

In [15]:
# interpret p-vale 
alpha = 0.05 
print('significance=%.3f, p=%.3f' %(alpha,p))
if p<= alpha :
    print('Reject Null Hypothesis ')
else : 
    print('Accept Null Hypothesis ')

significance=0.050, p=0.660
Accept Null Hypothesis

# Q4

In [16]:
q4 = pd.read_csv('Costomer+OrderForm.csv')

In [17]:
q4

    Phillippines   Indonesia       Malta       India
0     Error Free  Error Free   Defective  Error Free
1     Error Free  Error Free  Error Free   Defective
2     Error Free   Defective   Defective  Error Free
3     Error Free  Error Free  Error Free  Error Free
4     Error Free  Error Free   Defective  Error Free
..           ...         ...         ...         ...
295   Error Free  Error Free  Error Free  Error Free
296   Error Free  Error Free  Error Free  Error Free
297   Error Free  Error Free   Defective  Error Free
298   Error Free  Error Free  Error Free  Error Free
299   Error Free   Defective   Defective  Error Free

[300 rows x 4 columns]

In [18]:
q4['Phillippines'].value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [19]:
q4['Indonesia'].value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [20]:
q4['Malta'].value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [21]:
q4['India'].value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

- Null Hypothesis : The Defective % dosenot varies by centre 
- alternative : The Defective % varies by centre

Test : Chi Square

In [22]:
# create contigency table 
table_2 = [[271,267,269,280],[29,33,31,20]]

In [23]:
stat,p,dof,expected = stats.chi2_contingency(table_2)
print('dof=%d' %dof)
print(p)

dof=3
0.2771020991233135

In [24]:
# interpret p-vale 
Significance_level = 0.05 
print('significance=%.3f, p=%.3f' %(alpha,p))
if p<= Significance_level:
    print('Reject Null Hypothesis ')
else : 
    print('Accept Null Hypothesis ')

significance=0.050, p=0.277
Accept Null Hypothesis